tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "openssl@3"
brew "apr-util"
brew "bettercap"
brew "cmake"
brew "node"
brew "mongosh"
brew "node@16"
brew "pkg-config"
brew "pyenv"
brew "ruby"
brew "subversion"
brew "trivy"
brew "watchman"
brew "zeek"
brew "mongodb/brew/mongodb-community"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felixangelov.bloc"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jeff-hykin.better-cpp-syntax"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "nash.awesome-flutter-snippets"
vscode "simonsiefke.svg-preview"
vscode "twxs.cmake"
vscode "wayou.vscode-todo-highlight"
