{
  "1": "Requesting an IP reservation from a public pool for a compute instance in Terraform can expose the instance to potential external threats, as it becomes directly reachable from the internet. This configuration may increase the risk of attacks such as port scanning, brute force, and denial-of-service (DoS). To enhance security, it is advisable to consider using private IP addresses and controlling access through defined entry points like a VPN or a jump host, especially for instances that handle sensitive data or critical operations.",
  "2": "Using outdated or insecure TLS versions for encryption exposes your system to vulnerabilities and potential attacks. Ensuring the use of TLS v1.2 or higher enhances security by providing stronger encryption and reducing the risk of data breaches.",
  "3": "Provisioning public IP addresses for resources unnecessarily exposes them to potential security threats and unauthorized access. Limiting access to only essential consumers enhances security by reducing the attack surface and protecting sensitive information.",
  "4": "If block devices are not encrypted, sensitive data stored on them is vulnerable to unauthorized access and potential data breaches. This lack of encryption compromises the security and confidentiality of the data at rest.",
  "5": "CloudFront is available through an unencrypted connection",
  "6": "Using outdated or insecure TLS versions for encryption exposes your system to vulnerabilities and potential attacks. Ensuring the use of TLS v1.2 or higher enhances security by providing stronger encryption and reducing the risk of data breaches.",
  "7": "Without enabling export logs for DocumentDB, it is difficult to accurately audit the usage and activity within the cluster. This lack of auditing capability increases the risk of undetected unauthorized access and complicates the investigation of security incidents.",
  "8": "Without encryption of the underlying storage used by DocumentDB, data is vulnerable if the disks are compromised. This lack of encryption can lead to unauthorized access and data breaches, compromising the security and confidentiality of the stored information.",
  "9": "If encryption is not enabled on EBS volumes, the volume data, disk I/O, and any derived snapshots are vulnerable to interception and unauthorized access. This lack of encryption increases the risk of data breaches and compromises the confidentiality and integrity of stored information.",
  "10": "If block devices are not encrypted, sensitive data stored on them is vulnerable to unauthorized access and potential data breaches. This lack of encryption compromises the security and confidentiality of the data at rest.",
  "11": "Creating resources in the default VPC, which lacks critical security features of a standard VPC, exposes them to potential security vulnerabilities. This configuration increases the risk of unauthorized access and data breaches, compromising the overall security of the infrastructure.",
  "12": "If access is not restricted to specific required ports, it increases the risk of unauthorized access and potential security vulnerabilities. Ensuring only necessary ports are open minimizes the attack surface and enhances the security of the system.",
  "13": "If ports are opened to connect to the public internet without restrictions, it exposes your resources to potential security threats and unauthorized access. Restricting access to specific IP addresses or ranges reduces this risk and enhances overall security by limiting connectivity to trusted sources only.",
  "14": "If ACLs are opened to the public internet, it significantly increases the risk of unauthorized access and potential attacks. Restricting access to specific IP addresses or ranges minimizes this risk, ensuring that only trusted sources can interact with your resources.",
  "15": "If resources are provisioned with public IP addresses unnecessarily, they become exposed to the internet, increasing the risk of unauthorized access and attacks. Limiting access to only necessary consumers enhances security by reducing the attack surface and protecting sensitive information.",
  "16": "The ability to scan images is not being used and vulnerabilities will not be highlighted",
  "17": "Image tags could be overwritten with compromised images",
  "18": "Data can be read from the EFS if compromised",
  "19": "If EKS clusters are publicly accessible by default, they are exposed to potential external threats and unauthorized access. Disabling public access in the `vpc_config` of the EKS cluster resource helps mitigate the risk of security breaches and protects the cluster's integrity.",
  "20": "If Elasticsearch data is not encrypted at rest, sensitive information stored in the database is vulnerable to unauthorized access. This increases the risk of data breaches and exposure of confidential information to unauthorized users.",
  "21": "In transit data between nodes could be read if intercepted",
  "22": "HTTP traffic can be intercepted and the contents read",
  "23": "Outdated SSL policies increase exposure to known vulnerabilities",
  "24": "If data stored within an ElastiCache replication node is not encrypted, it is vulnerable to unauthorized access and potential data breaches. This lack of encryption compromises the privacy and security of sensitive information, increasing the risk of data exposure.",
  "25": "If traffic between ElastiCache replication nodes is not encrypted, sensitive data may be exposed to interception and unauthorized access during transmission. This lack of encryption compromises data privacy and security, increasing the risk of data breaches and unauthorized data manipulation.",
  "26": "Exposing a load balancer to the internet without ensuring it is necessary can lead to unintended access to internal assets, increasing the risk of unauthorized access and potential data breaches. This exposure can compromise the security and integrity of the internal network and associated resources.",
  "27": "Invalid headers being passed through to the target of the load balance may exploit vulnerabilities.By setting drop_invalid_header_fields to true, anything that doe not conform to well known, defined headers will be removed by the load balancer.",
  "28": "Plain HTTP is unencrypted and human-readable. This means that if a malicious actor was to eavesdrop on your connection, they would be able to see all of your data flowing back and forth.",
  "29": "Compromise of the root account compromises the entire AWS account and all resources within it.",
  "30": "Long life KMS keys increase the attack surface when compromised",
  "31": "Without audit logging it is difficult to trace activity in the MQ broker",
  "32": "Without logging enabled, tracing issues and investigating activities within the system is challenging, leading to delayed or incomplete incident responses. The absence of detailed logs and historical data can hinder effective troubleshooting and security investigations, increasing the risk of undetected breaches and operational disruptions.",
  "33": "If public access to the MQ broker is not disabled, it exposes the broker to potential unauthorized access and attacks. Limiting access only to necessary applications enhances security by reducing the attack surface and preventing potential data breaches and unauthorized data transmissions.",
  "34": "If encryption is not enforced for Kafka clusters, including communication between nodes, sensitive data can be exposed to interception and unauthorized access. This lack of encryption compromises data privacy and security, increasing the risk of data breaches and unauthorized data manipulation during transmission.",
  "35": "Without encryption of Neptune storage, data is vulnerable if the underlying disks are compromised, leading to potential unauthorized access and data breaches. Encryption ensures that even if the disks are accessed by unauthorized parties, the data remains protected and unreadable.",
  "36": "If Neptune databases use only AWS-managed keys for encryption, there is less control over key management practices, such as rotation and access policies. This reliance can lead to potential security risks and compliance issues, as customer managed keys offer enhanced control and customization to meet specific security requirements.",
  "37": "Without adequate monitoring, performance related issues may go unreported and potentially lead to compromise.",
  "38": "Running AWS resources in the Classic environment exposes them to potential security risks due to the shared nature of the infrastructure. By not utilizing a Virtual Private Cloud (VPC), resources are more vulnerable to attacks and unauthorized access from other AWS customers, compromising the isolation and security that a VPC offers.",
  "39": "If database resources are publicly accessible, they are vulnerable to a wider range of attacks, such as SQL injection, brute force, and denial of service (DoS). This configuration increases the likelihood of unauthorized access, data breaches, and potential data loss, undermining the security of sensitive information.",
  "40": "If S3 buckets are configured to ignore rather than block public ACLs, PUT calls containing public ACLs will be processed but the ACL settings will be disregarded. This approach prevents the accidental public exposure of buckets and objects, reducing the risk of unauthorized access and data leaks while maintaining compatibility with existing application workflows that might unknowingly include public ACLs.",
  "41": "Public access to the bucket can lead to data leakage",
  "42": "If S3 buckets do not restrict public policies using the `restrict_public_buckets` option, they can be accessible to unauthorized external users. This configuration increases the risk of unintended data exposure and potential data leaks, making sensitive information accessible to the public.",
  "43": "Using the data.http block in Terraform to send secret data can lead to unintended data exposure if the destination is not secure. This practice increases the risk of sensitive information being intercepted or misused, potentially leading to data breaches and violations of privacy regulations.",
  "44": "Not all metrics and logs may be gathered for containers when Container Insights isn't enabled",
  "45": "Data stored in the cache that is unencrypted may be vulnerable to compromise",
  "46": "Without full tracing enabled it is difficult to trace the flow of logs",
  "47": "If API Gateway methods are not protected by authorization or an API key, sensitive data accessed through these APIs can be exposed to unauthorized users. This exposure significantly increases the risk of data breaches and unauthorized operations, undermining the security and integrity of the application's data flows.",
  "48": "",
  "49": "If Athena databases and workspace result sets are not encrypted at rest, sensitive data derived from S3 buckets is vulnerable to unauthorized access and potential exposure. This lack of encryption could lead to data breaches, compromising the confidentiality and integrity of the data used in analytical processes.",
  "50": "Instance metadata service can be interacted with freely",
  "51": "Logging provides vital information about access and usage",
  "52": "If a CloudTrail is not configured to cover all regions, changes or activities in non-monitored regions might go undetected. This partial coverage can lead to significant security risks, as unauthorized actions or breaches in these unmonitored regions can occur without being logged, potentially resulting in unnoticed security vulnerabilities or compliance issues.",
  "53": "Data can be freely read if compromised",
  "54": "If log validation is not enabled on CloudTrail logs, the integrity of the log data stored in S3 buckets cannot be guaranteed. This lack of validation increases the risk that a malicious actor could tamper with the logs to obscure their activities, hindering forensic investigations and complicating efforts to detect and respond to security incidents.",
  "55": "If CloudTrail is not enabled in an AWS account, tracking and logging API calls across the infrastructure is impossible. This omission can lead to significant gaps in security monitoring and auditing, making it difficult to detect and respond to unauthorized access or changes in the environment, potentially leading to unnoticed breaches or compliance issues.",
  "56": "If S3 bucket access logging is not enabled on the CloudTrail S3 bucket, there may be no detailed records of access events, such as reads and writes. This lack of logging data hampers the ability to perform thorough security audits and incident analysis, potentially delaying the detection and response to unauthorized access or data breaches.",
  "57": "Log data may be leaked if the logs are compromised. No auditing of who have viewed the logs.",
  "58": "If artifacts produced by a CodeBuild project pipeline are not encrypted, sensitive data contained within those artifacts could be exposed if unauthorized access occurs. This lack of encryption increases the risk of data breaches and intellectual property theft.",
  "59": "If the configuration aggregator in AWS is not set to include all regions, configurations in unmonitored regions may go unchecked, increasing the risk of unnoticed security misconfigurations or unauthorized activities. This can lead to vulnerabilities and potential breaches in supposedly inactive or less monitored regions.",
  "60": "Using only AWS-managed keys for encrypting DocumentDB means less control over encryption specifics, such as key rotation and access policies. This limitation can lead to compliance issues and reduced security, as customer managed keys offer enhanced capabilities to tailor encryption practices to specific security requirements.",
  "61": "Accidental or malicious writes and deletes can't be rolled back",
  "62": "If DynamoDB tables use only AWS-managed default encryption keys rather than Customer Managed Keys (CMKs), users have less control over encryption practices like key rotation and auditing. This can lead to potential security risks and compliance issues, as relying solely on AWS-managed keys may not meet certain organizational or regulatory encryption standards.",
  "63": "Using AWS managed keys does not allow for fine grained control",
  "64": "Descriptions provide context for the firewall rule reasons. Not having them complicates auditing and understanding the purpose and appropriateness of security configurations. This can lead to difficulties in managing and identifying outdated or unnecessary rules, increasing the risk of security gaps and misconfigurations",
  "65": "Descriptions provide context for the firewall rule reasons. Not having them complicates auditing and understanding the purpose and appropriateness of security configurations. This can lead to difficulties in managing and identifying outdated or unnecessary rules, increasing the risk of security gaps and misconfigurations",
  "66": "If the IMDS session authentication tokens are set to optional rather than required, unauthorized users may exploit this to intercept or spoof metadata requests. This can lead to the leakage of sensitive data or credentials associated with AWS instances, increasing the risk of security breaches and potential system compromises.",
  "67": "If the IMDS session authentication tokens are set to optional rather than required, unauthorized users may exploit this to intercept or spoof metadata requests. This can lead to the leakage of sensitive data or credentials associated with AWS instances, increasing the risk of security breaches and potential system compromises.",
  "68": "Using AWS managed keys does not allow for fine grained control",
  "69": "Using AWS managed keys does not allow for fine grained control",
  "70": "Not all metrics and logs may be gathered for containers when Container Insights isn't enabled",
  "71": "Logging provides vital information about access and usage",
  "72": "If security groups and their rules lack descriptions, it complicates auditing and understanding the purpose and appropriateness of security configurations. This can lead to difficulties in managing and identifying outdated or unnecessary rules, increasing the risk of security gaps and misconfigurations.",
  "73": "If Redis clusters do not have a snapshot retention policy set, there may be no backups available to restore data in case of data corruption or loss. This can result in permanent data loss and significant disruptions to operations dependent on that data.",
  "74": "Password reuse increase the risk of compromised passwords being abused",
  "75": "Short, simple passwords are easier to compromise",
  "76": "Short, simple passwords are easier to compromise",
  "77": "Short, simple passwords are easier to compromise",
  "78": "Short, simple passwords are easier to compromise",
  "79": "Long life password increase the likelihood of a password eventually being compromised",
  "80": "If IAM account password policies do not enforce a minimum password length, weaker and shorter passwords may be used, increasing the risk of brute force attacks and unauthorized access. This can lead to compromised user accounts and potential data breaches.",
  "81": "Without this, any resource from principal will be granted permission – even if that resource is from another account. Not providing the source ARN allows any resource from principal, even from other accounts",
  "82": "If logging is not enabled, tracing issues and investigating activities within systems become significantly more difficult. This lack of detailed logs and historical data can hinder effective troubleshooting and delay responses to security incidents, potentially exacerbating damage and operational disruptions.",
  "83": "Data can be read from the RDS Performance Insights if it is compromised",
  "84": "Data can be read from the RDS cluster if it is compromised",
  "85": "Data can be read from RDS instances if compromised",
  "86": "Redshift clusters created without subnet details and running in EC2 classic mode are not contained within a Virtual Private Cloud (VPC), exposing them to potential security risks. This setup allows broader network access, increasing the likelihood of unauthorized access and potential data breaches.",
  "87": "Data may be leaked if infrastructure is compromised",
  "88": "PUT calls with public ACLs specified can make objects public",
  "89": "Without a block public access policy on S3 buckets, users can unintentionally or maliciously set policies that expose data to public access, leading to potential data leaks and unauthorized data exposure.",
  "90": "If S3 buckets are not encrypted, data stored within them is vulnerable to unauthorized access and potential exposure in the event of a security breach. This can lead to data theft, loss of privacy, and compliance violations.",
  "91": "If logging is not enabled on S3 buckets, access to the bucket cannot be audited, which complicates the detection of unauthorized access or data breaches. This lack of visibility increases the risk of security incidents going unnoticed and unaddressed.",
  "92": "If versioning is disabled in Amazon S3, accidental deletions or overwrites of objects cannot be reversed, leading to potential permanent data loss. Additionally, it limits the ability to restore previous versions of data after application failures or human errors, increasing the risk of operational disruptions.",
  "93": "The SNS topic messages could be read if compromised",
  "94": "The SQS queue messages could be read if compromised",
  "95": "If workspace volumes for both user and root are not encrypted, sensitive data stored on these volumes could be accessed and read by unauthorized parties, leading to potential data breaches and privacy violations.",
  "96": "Exfiltration of data to the public internet",
  "97": "Exposure of infrastructure to the public internet",
  "98": "Unencrypted sensitive plaintext value can be easily accessible in code.",
  "99": "Commits may not be verified and signed as coming from a trusted developer",
  "100": "Known vulnerabilities may not be discovered",
  "101": "Anyone can read the contents of the GitHub repository and leak IP",
  "102": "Failing to protect IAM groups with Multi-Factor Authentication (MFA) can leave your Terraform-managed AWS environment vulnerable to unauthorized access, especially if password credentials are compromised. Implementing MFA adds an additional layer of security by requiring a second form of verification, significantly reducing the risk of an attacker gaining access through stolen or weak credentials. Using the `terraform-module/enforce-mfa/aws` ensures that MFA is enforced for all IAM group users, providing a stronger security posture against potential breaches."
}
